import NoteItem from "../noteItem";

//Создайте необходимые папки и файлы для вашего проекта: App.js,
//  NoteList.jsx, NoteForm.jsx, и Note.jsx. Также создайте папку styles
//  для CSS модулей.
// Определите CSS модули для каждого компонента (App.module.css, NoteList.module.css, NoteForm.module.css, и Note.module.css).
// Импортируйте стили и компонент NoteList.
// Создайте базовую разметку, включающую в себя контейнер для NoteList.
// Импортируйте необходимые зависимости и компоненты (NoteForm и Note), а также CSS модуль.
// Используйте useState для управления списком заметок.
// Создайте функцию listUpdate, которая добавляет новую заметку в список.
// Отрендерите NoteForm и передайте ему функцию listUpdate через props.
// Отобразите все заметки, используя .map() для массива noteList и компонент Note для каждой заметки.
// Импортируйте зависимости и стили.
// Установите локальное состояние для текста новой заметки.
// Создайте функцию handleChange, которая обновляет состояние при изменении текста в поле ввода.
// Создайте функцию handleSubmit, которая предотвращает стандартное поведение формы, использует колбэк для обновления списка заметок и очищает поле ввода.
// Отрендерите форму с текстовым полем и кнопкой для отправки.
// Импортируйте зависимости и стили.
// Инициализируйте состояние для статуса заметки (готово/не готово).
// Создайте функцию handleChange, которая переключает статус заметки.
// Отрендерите заметку с условным форматированием для отображения статуса и чекбокс для изменения статуса.
// Стилизуйте созданные компоненты, чтобы придать приятный вид своему приложению
// Проверьте, что приложение корректно добавляет заметки.
// Проверьте функциональность переключения статуса заметки.
// Убедитесь, что стили корректно применяются

function NoteList({ notes }) {
  return (
    <ul>
      {notes.map((note) => (
        <NoteItem key={note.id} note={note} />
      ))}
    </ul>
  );
}
export default NoteList;
